Repository: gardenifi/raspirri_app
Catalog: lib/src/localization/app_*.arb
Languages: el

# fullName
source: Tom Makrodimos
el: Θωμάς Μακροδήμος

# welcomeText
source: Welcome to automatic irrigation system
el: Καλώς ήρθατε στο αυτόματο σύστημα ποτίσματος

# okLabel
source: Ok
el: Oκ

# cancelLabel
source: Cancel
el: Ακύρωση

# yesLabel
source: Yes
el: Ναι

# addRemoveButtonLabel
source: Add/Remove valves
el: Διαχείριση βανών

# initializeButtonLabel
source: Initialize IoT device
el: Αρχικοποίηση IoT συσκευής

# initializeDialogTitle
source: Initialize
el: Αρχικοποίηση

# initializeDialogPrompt
source: Are you sure you want to initialze the IoT device
el: Είστε σίγουρος ότι θέλετε να αρχικοποιήσετε την IoT συσκευή;

# rebootButtonLabel
source: Reboot IoT device
el: Επανεκκίνηση IoT συσκευής

# rebootDialogTitle
source: Reboot IoT device
el: Επανεκκίνηση

# rebootDialogPrompt
source: Are you sure you want to reboot IoT device? Your programs will not be lost
el: Είστε σίγουρος ότι θέλετε να επανεκκινήσετε την IoT συσκευή; Τα προγράμματα των βανών δεν θα χαθούν.

# rebootSnackbarContent
source: IoT will reboot now!
el: Η IoT συσκευή Θα επανεκκινήση τώρα!

# updateTitle
source: Update server
el: Ενημέρωση σέρβερ

# updateDialogPrompt
source: You will update the server of IoT device. Your programs will not be lost.
el: Θα γίνει ενημέρωση του σέρβερ της IoT συσκευής. Τα προγράμματα των βανών δεν θα χαθούν.

# updateSnackbarContent
source: IoT device will udate the server now!
el: Ο σέρβερ της IoT συσκευής θα ενημερωθεί τώρα!

# aboutLabel
source: About
el: Σχετικά

# exitButtonLabel
source: Exit
el: Έξοδος

# exitDialogTitle
source: Exit
el: Έξοδος

# exitDialogPrompt
source: Are you sure you want to exit the app?
el: Είστε σίγουρος ότι θέλετε να κλείσετε την εφαρμογή;

# noBluetoothPrompt
source: App require bluetooth to be turned on
el: Για την λειτουργία της εφαρμογής είναι απαραίτητη η ενεργοποίηση του bluetooth

# noBluetoothAction
source: Turn on Bluetooth
el: Ενεργοποίηση Bluetooth

# goToWifiSetupScreenText
source: Press Continue to go to WiFi setup screen
el: Πατήστε 'Συνέχεια' για να μεταβείτε στην οθόνη ρύθμισης WiFi

# continueButtonLabel
source: Continue
el: Συνέχεια

# searchingDeviceTitle
source: Searching IoT device...
el: Αναζήτηση συσκευής IoT...

# searchingDeviceSubtitle
source: Please hold your phone near IoT device
el: Κρατήστε το τηλέφωνό σας κοντά στη συσκευή IoT

# connectingDeviceTitle
source: Connecting...
el: Σύνδεση...

# connectingDeviceSubtitle
source: Please hold your phone near IoT device
el: Κρατήστε το τηλέφωνό σας κοντά στη συσκευή IoT

# bluetoothConnectionPrompt
source: Before continue you must configure the IoT device via bluetooth connection
el: Πριν συνεχίσετε πρέπει να γίνει ρύθμιση της συσκευής ΙοΤ μέσω σύνδεσης Bluetooth

# bluetoothConnectionButtonLabel
source: Bluetooth Connection
el: Σύνδεση Bluettooth

# couldNotConnectBluetoothText
source: Could not connect with IoT device
el: Δεν ήταν δυνατή η σύνδεση με την ΙοΤ συσκευή

# tryAgainButtonLabel
source: Try again
el: Προσπαθήστε ξανά

# deviceNotFoundTitle
source: IoT Device not found or connection with ΙοΤ device lost
el: Η ΙοΤ συσκευή δεν βρέθηκε ή η σύνδεση διακόπηκε

# deviceNotFoundSubtitle
source: Make sure IoT device is on and try again
el: Βεβαιωθήτε ότι η ΙοΤ συσκευή είναι ενεργοποιημένη και προσπαθήστε ξανά

# pairingSuccesfulText
source: Pairing Succesful
el: Επιτυχής σύνδεση!

# selectNetworkLabel
source: Select from the list the desired network and then fill in the password
el: Επιλέξτε από την λίστα το επιθυμητό δίκτυο και εισάγετε τον κωδικό

# selectNetworkHintText
source: Select network
el: Επιλέξτε δίκτυο

# enterPasswordLabel
source: Enter the password of network
el: Εισάγετε τον κωδικό του δικτύου

# connectToNetworkText
source: Press 'Connect' to connect the ΙοΤ device to the desired network
el: Πατήστε 'Σύνδεση' για να συνδέσετε την συσκευή ΙοΤ στο δίκτυο

# connectToNetworkButtonLabel
source: Connect
el: Σύνδεση

# deviceConnectedText
source: IoT device connected to internet succesfuly
el: Η συσκευή ΙοΤ συνδέθηκε στο ίντερνετ επιτυχώς!

# goToMainScreenText
source: You are ready! Press 'Continue' to go to main screen
el: Είστε έτοιμος! Πατήστε 'Συνέχεια' για να μεταβείτε στην κύρια οθόνη

# deviceCouldNotConnectText
source: IoT device could not connect to internet
el: Η συσκευή IoT δεν μπόρεσε να συνδεθεί στο διαδύκτιο. Δοκιμάστε ξανά

# ifProblemPersistText
source: If problem persist go back and check network ssid and password
el: Αν το πρόβλημα συνεχίζει, πάτε πίσω και ελέγξτε το ssid και τον κωδικό δικτύου

# goBackButtonLabel
source: Go back
el: Πίσω

# somethingWentWrongText
source: Oups ... something went wrong!
el: Ουπς... κάτι δεν πήγε καλά!

# refreshListLabel
source: Refresh list
el: Ανανέωση λίστας

# waitWhileConnectingText
source: Please wait while IoT is connecting to internet
el: Παρακαλώ περιμένετε όσο η συσκευή ΙοΤ συνδέεται στο διαδύκτιο

# waitWhileFetchingNetworksText
source: Please wait while fetching networks
el: Παρακαλώ περιμένετε όσο γίνεται ανάκτηση των δικτύων

# cantConnectToBrokerText
source: Can't connect to broker.
el: Αδυναμία σύνδεσης στον διακομιστή

# makeSureYouAreConnectedText
source: Make sure you are connected to internet and try again
el: Βεβαιωθείτε ότι είστε συνδεδεμένοι στο διαδίκτυο και προσπαθήστε ξανά

# exitAppText
source: If problem persist, maybe broker is down.Exit the app and try again later.
el: Αν το πρόβλημα συνεχίζει πιθανόν να υπάρχει πρόβλημα στον διακομιστή. Κλείστε την εφαρμογή και δοκιμάστε αργότερα.

# deviceDisconnectedFromBrokerText
source: IoT device disconnected from broker!
el: Η συσκευή ΙοΤ αποσυνδέθηκε από τον διακομιστή

# makeSureDeviceIsPoweredOnText
source: Make sure IoT device is powered on
el: Βεβαιωθείται ότι η συσκευή ΙοΤ είναι ενεργοποιημένη

# disconnectedFromBrokerText
source: Disconnected from broker
el: Αποσυνδεθείκατε απο τον διακομιστή

# connectedToBrokerSnackbarText
source: Connected to broker
el: Συνδεθήκατε στον διακομιστή

# ifProblemPersistOnDisconnectingFromBrokerText
source: If problem persist exit the app and try open it again.
el: Αν το πρόβλημα συνεχίζει κλείστε την εφαρμογή και ανοίξτε την ξανά

# areYouSureDialogTitle
source: Are you sure?
el: Είστε σίγουροι;

# changesHaveNotBeenSavedText
source: There are changes that have not been saved. Are you sure you want to go back?
el: Υπάρχουν αλλαγές που δεν έχουν αποθηκευτεί. Είστε σίγουροι ότι θέλετε να επιστρέψετε;

# selectDaysToIrrigateText
source: Select the days you want to irrigate
el: Επιλέξτε τις ημέρες που θέλετε να ποτίσετε

# editCreateProgramTitle
source: Edit/Create program
el: Επεξεργασία/Δημιουργία προγράμματος

# valveIsOnDialogTitle
source: Valve is on!
el: Η βάνα είναι ανοιχτή!

# valveIsOnDialogContent
source: Please turn off valve before remove it from IoT device!
el: Παρακαλώ κλείστε τη βάνα πριν την αφαιρέσετε από τη συσκευή IoT!

# valveDeletionDialogTitle
source: Valve deletion
el: Διαγραφή βάνας

# valveDeletionDialogContent
source: Are you sure you want to remove this valve? All programs of this valve will be also deleted.
el: Είστε σίγουροι ότι θέλετε να αφαιρέσετε αυτήν τη βάνα; Όλα τα προγράμματα αυτής της βάνας θα διαγραφούν.

# addValveLabel
source: Add
el: Προσθήκη

# removeValveLabel
source: Remove
el: Αφαίρεση

# selectStartTimeText
source: Select start time
el: Επιλογή ώρας έναρξης

# addIrrigationCycleLabel
source: Add an irrigation cycle
el: Προσθήκη κύκλου ποτίσματος

# deleteProgramButtonLabel
source: Delete program
el: Διαγραφή προγράμματος

# programDeletionDialogTitle
source: Program deletion
el: Διαγραφή προγράμματος

# programDeletionDialogContent
source: Are you sure you want to delete this program?
el: Είστε βέβαιοι ότι θέλετε να διαγράψετε αυτό το πρόγραμμα;

# saveButtonLabel
source: Save
el: Αποθήκευση

# cycleDeletionDialogTitle
source: Cycle deletion
el: Διαγραφή κύκλου

# cycleDeletionDialogContent
source: Are you sure you want to delete this cycle?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το κύκλο ποτίσματος;

source: Cycle {number}
el: Κύκλος {number}

# startLabel
source: Start:
el: Έναρξη:

# durationLabel
source: Duration:
el: Διάρκεια:

# noValveText
source: No valve has been registered.
el: Δεν έχει προστεθεί βάνα.

# plugValveText
source: Plug one or more valves in IoT device and select the port number from the button below to enable them.
el: Συνδέστε μία ή περισσότερες βάνες στην συσκευή IoT και προσθέστε την αντίστοιχη είσοδο πατώντας το παρακάτω κουμπί

# addValvesButtonLabel
source: Add valves
el: Προσθήκη βάνας

# addRemoveValveBottomSheetTitle
source: Add/Remove valves
el: Προσθήκη/Αφαίρεση βανών

# doneButtonLabel
source: Done
el: Τέλος

# selectDurationTitle
source: Select duration
el: Επιλογή διάρκειας

source: Valve {number}
el: Βάνα {number}

# closesAtText
source: Closes at {endTime}
el: Κλείνει {endTime}

# nextRunText
source: Next run:
el: Επόμενο άνοιγμα:

# noProgramText
source: No program
el: Δεν υπάρχει πρόγραμμα

# programSendSnackbarText
source: Program send to broker
el: Το πρόγραμμα στάλθηκε στον διακομιστή

# programCouldNotSendSnackbarText
source: Could not send program to broker. Try again
el: Αποτυχία αποστολής προγράμματος στον διακομιστή. Προσπαθείστε ξανά

# programDeletedSnackbarText
source: Program deleted
el: Το πρόγραμμα διαγράφηκε

# createProgramText
source: Create program
el: Δημιουργία προγράμματος

# viewEditProgramText
source: View/Edit program
el: Προβολή/Επεξεργασία προγράμματος

# collapseButtonLabel
source: Collapse all
el: Σύμπτυξη όλων

# expandButtonLabel
source: Expand all
el: Ανάπτυξη όλων

# nextRunTodayAtText
source: Today {time}
el: Σήμερα {time}

# nextRunDayAtText
source: Next {day} {time}
el: {day} {time}

# day
source: {day, select, Mon{Mon} Tue{Tue} Wed{Wed} Thu{Thu} Fri{Fri} Sat{Sat} Sun{Sun} other{_}}
el: {day, select, Mon{Δευ} Tue{Τρι} Wed{Τετ} Thu{Πεμ} Fri{Παρ} Sat{Σαβ} Sun{Κυρ} other{_}}
